english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* stand
:PROPERTIES:
:EXPORT_FILE_NAME: stand.md
:END:
站立
** 语义
*** 站立
It looks we'll have to stand - there are no seats left.
*** 起立
Smiling, she stood and closed the blinds.
*** 走
She stood back to let him in.
*** 使直立
A lamp stood on the table.
*** 处于
The kitchen door stood open so she went in.
*** 不能忍受
I can't stand bad manners.
*** 接受
I couldn't stand the thought of leaving Danielle.
*** 经得起
His poetry will stand the test of time.
*** 不动
The car's been standing in the garage for weeks.
*** 高达
John stood six feet tall.
*** 有...水平
His former workforce of 1300 now stands at 220.
*** 位于
The president stands high in the public opinion polls.
*** 竞选
She announced her intention to stand for parliament.
*** 保持不变
Despite protests, the official decision stood.
*** 架
He adjusted the microphone stand.
*** 摊位
The shop was crowded with display stands and boxed.
*** 主张
She was accused of not taking a stand on feminism or civil rights.
*** 反抗
We have to take a stand against racism.
*** 看台
In the stands, fifty of Jill's friends and family have come to watch her last game.
*** 车站
There's taxi stand on Glen Road.
** 短语
*** stand clear of
Stand clear of the doors, please.
*** stand in
Don't stand in that puddle!
*** where do things stand
Where do things stand in terms of the budget?
*** stand to do something
What do firms think they stand to gain by merging?
*** where somebody stand
You must decide where you stand.
*** from where I stand
I knew from where I stood that the stocks were practically worthless.
*** know where you stand
I'd like to know where I stand.
*** stand in the way
You can't stand in the way of progress!
*** stand on your own feet
She's never learned to stand on her own feet.
*** it stands to reason
It stands to reason that you cannot find the right person to do a job unless you know exatly what that job is.
*** stand or fall on something
The case against him will stand or fall on its own merits.
*** stand trial
Gresham will stand trial for murder.
*** stand tall
Stand tall with your feet comfortably apart.
*** be stood on its head
One area of the business which has been stood on its head is internal communications.
*** not stand on ceremony
Comeon, Mal. Don't stand on ceremony here at home.
*** stand somebody a drink
Come on, Jack, I'll stand you a drink if you like.
*** stand against
She hadn't the strength to stand against her aunt's demands.
*** stand around
We stood around saying goodbye for a while.
*** stand by
I'm not going to stand by and see her hurt.
**** 遵守
I stand by what I said earlier.
**** 支持某人
His wife stood by him during his years in prison.
**** 准备行动
Rescue crews were standing by in case of a breakdown.
*** stand down
He was obliged to stand down as a parliamentary candidate.
*** stand for
What does ATM stand for?
**** 支持
It's hard to tell what the party stands for these days?
*** stand in
Would you mind standing in for me a while?
*** stand out
She always stood out in a crowd.
**** 出色
That day still stands out as the greatest day in my life.
**** 凸出
The veins stood out on his throat and temples.
*** stand over
I can't concentrate with him standing over me like that.
*** stand to
The men have been stood to.
*** stand up
I've been standing up all day.
**** 耐用
Most of the plants stood up well to the heat.
**** 证明真实
The memoirs stand up well to cross-checking with other records.
*** stand up for
It's time we stood up for our rights.
*** stand up to
He'll respect you more if you stand up to him.
